---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PropertySegmentDistance
source: html/ad88a55e-47c5-c677-0a97-9c64eb2c0996.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PropertySegmentDistance Property

"Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId PropertySegmentDistance { get; }
```